---
kind: type
id: T:Autodesk.Revit.DB.Reference
source: html/d28155ae-817b-1f31-9c3f-c9c6a28acc0d.htm
---
# Autodesk.Revit.DB.Reference

A stable reference to a geometric object in a Revit model.

## Syntax (C#)
```csharp
public class Reference : APIObject
```